CREATE DATABASE HRBase;
USE HRBase;

DROP TABLE ViddilKadriv;
DROP TABLE ForHR;
DROP TABLE AboutWorker;
DROP TABLE DetailsWorker;

CREATE TABLE ViddilKadriv(   

id INT NOT NULL,
-- Хто
ВідпHR VARCHAR(20),
-- Кого
ПрізвищеПрацівника VARCHAR(10),
ІмяПрацівника VARCHAR(10),
ПоБатьковіПрацівника VARCHAR(10),
Phone VARCHAR(20) DEFAULT 'Unknown', 
ДатаНародження VARCHAR(10),
Овсіта VARCHAR(10),
Ступінь VARCHAR(10),

-- -- Коли
ДатаПрийняття VARCHAR(10),

-- -- Куди
Департамент VARCHAR(20),
Посада VARCHAR(20),
ОблікВпрофспілці VARCHAR(25),
Безп_Керівник VARCHAR(20),

-- -- Додаткові умови
Ставка DOUBLE NOT NULL,
Щорічна_Відпустка VARCHAR(20),
Додаткова_відпустка INT NOT NULL,
КомпенсаціяЗаШкліжливістьРоботи VARCHAR(20),
НаявністьНеповнолітніхДітей VARCHAR(20),
КількістьНеповнолітніхДітей INT NOT NULL,
ДоступДоКорпоративноїбезпеки VARCHAR(20),
Судимість VARCHAR(25),
Військовийоблік VARCHAR(30),
data datetime NOT NULL,

-- -- При умові звільнення
ДатаЗвільнення VARCHAR(10),

PRIMARY KEY(id)


);

INSERT INTO ViddilKadriv
(id, ВідпHR,
ПрізвищеПрацівника, ІмяПрацівника, ПоБатьковіПрацівника,Phone,ДатаНародження, Овсіта, Ступінь,
ДатаПрийняття,
Департамент, Посада,ОблікВпрофспілці ,Безп_Керівник,
Ставка, Щорічна_Відпустка, Додаткова_відпустка, КомпенсаціяЗаШкліжливістьРоботи ,НаявністьНеповнолітніхДітей,КількістьНеповнолітніхДітей, ДоступДоКорпоративноїбезпеки,Судимість,Військовийоблік,data,
ДатаЗвільнення
)
VALUES
(1,'Іванова С.C.','Сердюков','Даниил','Андрійович','380997776655','10/10/1990','Вища','Бакалавр','20/08/2022','Юридичний','Стажер','НІ','Шапокляк Л.П.',2900.89, 30 , 7, 'НІ', 'НІ', 0, 'НІ','Відсутня','військозабовязаний' ,now(),'00/00/0000'),
(2,'Іванова С.C.','Шапокляк','Луіза' ,'Петрівна'  ,'380674453232','10/10/1970','Вища','Магістр' ,'01/03/2000','Юридичний','Начальник','ТАК','Лучкова К.І.' ,22900.89, 30 , 0, 'НІ', 'ТАК', 3, 'ТАК','Відсутня','Ветеран ЗСУ'   ,now(),'00/00/0000'),
(3,'Іванова С.C.','Короткий','Микола','Федорович' ,'380635998877','10/10/1977','Вища','Магістр' ,'08/05/2010','Юридичний','Юрист'    ,'ТАК','Шапокляк Л.П.',119999.99, 30 , 0, 'НІ', 'ТАК', 1, 'ТАК','Раніше засуджений','Ветеран Поліції',now(),'00/00/0000');


SELECT * FROM ViddilKadriv;


-- Нормалізація 
-- ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

CREATE TABLE ForHR(

HRid INT NOT NULL,
ВідпHR VARCHAR(20),
ПрізвищеПрацівника VARCHAR(10),
Ставка DOUBLE NOT NULL,
Щорічна_Відпустка VARCHAR(20),
Додаткова_відпустка INT NOT NULL,
ДатаЗвільнення VARCHAR(10),
data datetime NOT NULL,

PRIMARY KEY(HRid)

);


INSERT INTO ForHR
(HRid,ВідпHR,ПрізвищеПрацівника,Ставка,Щорічна_Відпустка,Додаткова_відпустка,ДатаЗвільнення,data)
VALUES
(1,'Іванова С.C.','Сердюков',2900.89,   30 , 7,'00/00/0000',data),
(2,'Іванова С.C.','Шапокляк',22900.89,  30 , 0,'00/00/0000',data),
(3,'Іванова С.C.','Короткий',119999.99, 30 , 0,'00/00/0000',data);



CREATE TABLE AboutWorker(
WorkerID INT NOT NULL,
ПрізвищеПрацівника VARCHAR(10),
ІмяПрацівника VARCHAR(10),
ПоБатьковіПрацівника VARCHAR(10),
Phone VARCHAR(20) DEFAULT 'Unknown', 
ДатаНародження VARCHAR(10),
Овсіта VARCHAR(10),
Ступінь VARCHAR(10),
ДатаПрийняття VARCHAR(10),
Департамент VARCHAR(20),
Посада VARCHAR(20),
ОблікВпрофспілці VARCHAR(25),
Безп_Керівник VARCHAR(20),

PRIMARY KEY (WorkerID),
FOREIGN KEY (WorkerID) REFERENCES ForHR(HRid)


);


INSERT INTO AboutWorker
(WorkerID,ПрізвищеПрацівника,ІмяПрацівника,ПоБатьковіПрацівника,Phone,ДатаНародження,Овсіта,Ступінь,ДатаПрийняття,Департамент,Посада,ОблікВпрофспілці,Безп_Керівник)
VALUES
(1,'Сердюков','Даниил','Андрійович','380997776655','10/10/1990','Вища','Бакалавр','20/08/2022','Юридичний','Стажер','НІ','Шапокляк Л.П.'),
(2,'Шапокляк','Луіза' ,'Петрівна'  ,'380674453232','10/10/1970','Вища','Магістр' ,'01/03/2000','Юридичний','Начальник','ТАК','Лучкова К.І.'),
(3,'Короткий','Микола','Федорович' ,'380635998877','10/10/1977','Вища','Магістр' ,'08/05/2010','Юридичний','Юрист'    ,'ТАК','Шапокляк Л.П.');



CREATE TABLE DetailsWorker(

DWid INT NOT NULL,

КомпенсаціяЗаШкліжливістьРоботи VARCHAR(20),
НаявністьНеповнолітніхДітей VARCHAR(20),
КількістьНеповнолітніхДітей INT NOT NULL,
ДоступДоКорпоративноїбезпеки VARCHAR(20),
Судимість VARCHAR(25),
Військовийоблік VARCHAR(30),

PRIMARY KEY (DWid),
FOREIGN KEY (DWid) REFERENCES ForHR(HRid)


);

INSERT INTO DetailsWorker
(DWid,КомпенсаціяЗаШкліжливістьРоботи,НаявністьНеповнолітніхДітей,КількістьНеповнолітніхДітей,ДоступДоКорпоративноїбезпеки,Судимість,Військовийоблік)
VALUES
(1,'НІ', 'НІ', 0, 'НІ','Відсутня','військозабовязаний'),
(2,'НІ', 'ТАК', 3, 'ТАК','Відсутня','Ветеран ЗСУ'),
(3,'НІ', 'ТАК', 1, 'ТАК','Раніше засуджений','Ветеран Поліції');


SELECT * FROM HRBase.ForHR;
SELECT * FROM HRBase.AboutWorker;
SELECT * FROM HRBase.DetailsWorker;